# n! / n 개의 수 만큼 맨 앞이 1, 2, 3 ,,, 인 각각의 경우의 수
# 이걸 반복?
# k를 n으로 나눠서 차례 찾기
# 몫에 + 1 한 값부터 시작
# 이걸 반복?
# 3! / 3 = 2, 각각 2개만큼 경우가 수가 존재 -> 5 / 2 = 2.5 -> 3부터 시작
# k 는 1개가 남음.
# 2개의 경우의 수, 2! / 2 = 1, 1 / 1 = 1 -> 1부터 시작
# k 는 0개가 남음
# 지금까지 사용하지 않은 수가 마지막 수

from math import ceil

def solution(n, k):
    경우의_수 = 1
    for i in range(1, n + 1):
        경우의_수 *= i
    
    사용하지_않은_수들 = list(range(n + 1))
    
    target_경우의_수 = []
    while k > 0:
        경우의_수 = 경우의_수 // n
        n -= 1
        curr = ceil(k / 경우의_수)
        target_경우의_수.append(사용하지_않은_수들[curr])
        k %= 경우의_수
        사용하지_않은_수들.remove(사용하지_않은_수들[curr])
    
    target_경우의_수 += 사용하지_않은_수들[::-1][:-1]
    
    answer = target_경우의_수
    return answer